---
title: StructuralSectionGeneralU
classe: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU
namespace: Autodesk.Revit.DB.Structure.StructuralSections
eredita: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# StructuralSectionGeneralU

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double FlangeFillet { get; set; }` | `structuralSectionGeneralU.FlangeFillet` | Double |
| `Double FlangeToeOfFillet { get; set; }` | `structuralSectionGeneralU.FlangeToeOfFillet` | Double |
| `Double SlopedFlangeAngle { get; set; }` | `structuralSectionGeneralU.SlopedFlangeAngle` | Double |
| `Double WebToeOfFillet { get; set; }` | `structuralSectionGeneralU.WebToeOfFillet` | Double |
| `Double GetFlangeThicknessInFlangeCenter()` | `structuralSectionGeneralU.GetFlangeThicknessInFlangeCenter()` | Double |
| `Double GetFlangeThicknessInWidthCenter()` | `structuralSectionGeneralU.GetFlangeThicknessInWidthCenter()` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```